[
  {
    "id": 1,
    "title": "Club Shines at the 2025 MFC Cup, Finishes as Proud Runners Up",
    "description": "Our club delivered an outstanding performance at the 2025 MFC Cup, securing second place after two days of competitive football.\n\nDay 1: Group Stage\nThe team opened the tournament strongly, finishing the group stage in second place with two wins and one loss. This solid start ensured qualification for the knockout rounds.\n\nDay 2: Knockout Stage\n\nQuarterfinal:\nThe team faced Auburn Nepalese FC and recorded a disciplined 2–0 victory, displaying strong organisation and teamwork.\n\nSemifinal:\nA dominant performance saw the club defeat Beni FC 4–1. The match featured a standout hattrick from striker Darshan Gurung, one of the highlights of the tournament.\n\nGrand Final:\nIn a hard-fought final, the team fell short 2–1 against St George Nepalese Club (SGNC), securing the runner-up position for this year’s competition. Congratulations to SGNC on winning the tournament.\n\nIndividual Recognition:\nStriker Darshan Gurung earned the Top Scorer Award of the tournament, an excellent achievement reflecting his impact throughout the competition.\n\nAcknowledgements:\nThe club extends its appreciation to the players, coaching staff, and management for their commitment and effort. We also thank our supporters and sponsors for their continuous encouragement. Additionally, we acknowledge Machhapuchhre FC for hosting another well-organised and successful tournament.",
    "date": "2025-12-06",
    "category": "Match Report",
    "image": "https://scontent.fsyd14-1.fna.fbcdn.net/v/t39.30808-6/594004410_1342671617897439_7498109603810253120_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=833d8c&_nc_eui2=AeFEG0-5JaO4oGKsLL1hAAvB9PLU3jDxyN_08tTeMPHI34TDepVtdaaHIZIklhaRiiU&_nc_ohc=5SNfRk9hz1sQ7kNvwENnbeu&_nc_oc=AdnLDr1zDh8iB-2VKpJ6w9eu2Q__IA97mpLJDW2LkAwSw93HXWthkw2haBbCHbzuSnbil3uQjrOgBaOiyT3cP0T7&_nc_zt=23&_nc_ht=scontent.fsyd14-1.fna&_nc_gid=UEGaVQ-MESME1pBjXYActQ&oh=00_Afkr2UFlLCSo1A_A8_OjLIVE5dDzrjqZHfSM9uZTtXOwLw&oe=6939E3F7"
  },
  {
    "id": 2,
    "title": "Tough Battle Ends in 2–1 Defeat to Southwest Rhinos FC",
    "description": "Our club delivered a spirited and determined performance, but ultimately fell 2–1 to Southwest Rhinos FC in a closely contested match. From kickoff, the team displayed strong intensity, pressing high, moving the ball with purpose, and creating several threatening opportunities. Despite the early pressure, it was Southwest Rhinos FC who capitalised on their chances to take the lead.\n\nThe team responded well, maintaining composure and working their way back into the match. Our goal came through Bibhushan KC, who once again showcased his quality with a calm and clinical finish. His strike brought momentum back to the squad, setting up a competitive second half.\n\nAs the match progressed, the players pushed forward with intent, creating multiple openings in search of an equaliser. The effort and resilience were evident across the pitch, but the final touch in front of goal proved elusive. Southwest Rhinos FC held their ground defensively and saw out the match.\n\nAlthough the result was disappointing, the performance highlighted several positives, including improved build-up play, strong defensive phases, and the growing cohesion within the squad. The team remains optimistic and is committed to bouncing back stronger in the next fixture, carrying forward the belief and work ethic shown in this match.",
    "date": "2025-11-24",
    "category": "Match Report",
    "image": "https://scontent.fmel18-1.fna.fbcdn.net/v/t51.82787-15/582079852_18322197694243824_2449004477260130160_n.jpg?_nc_cat=108&ccb=1-7&_nc_sid=127cfc&_nc_eui2=AeGyFEisG8fIbIBtsNFBDcPWYIpU3Qny6_BgilTdCfLr8NsrhR7rmcquL-6BhOJZ0zM&_nc_ohc=Gx_Rf-SCaq8Q7kNvwFLzkFJ&_nc_oc=AdmSWaktUahTpRcpe727mKXaHQBiGk2YOM72dMAZTpoy1NnUvR5f7fQYypC4SYbGq7_IYKYddV6lryW8jNFPC9NG&_nc_zt=23&_nc_ht=scontent.fmel18-1.fna&_nc_gid=wvWDmmVQUVqN0Ozica9e1Q&oh=00_AflUQqjLmQ8nC8ZGxZqKJD01X9cfj4KBg7buoXK4SuXiFg&oe=693A06D3"
  },
  {
    "id": 3,
    "title": "Official Reveal of Our New Home and Away Jerseys",
    "description": "Our club is excited to officially unveil our new Home and Away jerseys for the upcoming season. The reveal was held in collaboration with our major partners, Ark Home Loan and Ark Accounting Solutions, whose ongoing support has been instrumental in bringing this project to life.\n\nHome Jersey:\nThe new Home jersey highlights the club's traditional colours complemented by a modern design that enhances both style and performance. Improved fabric technology ensures better comfort and durability for players throughout the season.\n\nAway Jersey:\nThe Away kit introduces a bold and distinctive design, offering players a fresh look while maintaining the club's identity. Built with the same high-performance materials as the Home jersey, it provides confidence and comfort during challenging away fixtures.\n\nCommunity Partnership:\nWe extend our appreciation to Ark Home Loan and Ark Accounting Solutions for their involvement in the official reveal event. Their commitment to supporting community football continues to strengthen our club's growth and development.\n\nThe new jerseys will make their debut in the opening fixture of the season. Further details, including images and availability, will be shared within the app soon.",
    "date": "2024-11-28",
    "category": "Club News",
    "image": "http://trgfc.xyz/src/assets/jerseyReveal.jpg"
  },
  {
    "id": 4,
    "title": "Christmas Break",
    "description": "As the holiday season approaches, the club will be taking a scheduled Christmas break, with all training sessions and matches paused for the next two weeks. This short recess allows players, coaches, and families to rest, recharge, and spend quality time together during the festive period.\n\nThroughout the first part of the season, the squad has shown consistent commitment, effort, and improvement across all areas. The break offers an opportunity for everyone to recover both physically and mentally before returning to prepare for the upcoming fixtures.\n\nDuring this period, all club facilities and training activities will remain closed. Regular sessions will resume following the two-week break, with updated schedules to be shared through the app.\n\nWe thank all players, parents, volunteers, and supporters for their continued dedication throughout the year. The club wishes everyone a safe, enjoyable, and restful Christmas and holiday season. We look forward to seeing everyone back on the field soon.",
    "date": "2024-11-22",
    "category": "Preview",
    "image": "https://scontent.fmel18-1.fna.fbcdn.net/v/t39.30808-6/491603429_1145171960980740_3516339126205120234_n.jpg?stp=cp6_dst-jpg_tt6&_nc_cat=100&ccb=1-7&_nc_sid=833d8c&_nc_eui2=AeFSR_k_UA4dNGpeLKyC7gk7DrZmiq1A1-8OtmaKrUDX78_umYfogiPlHQI1d51O_rQ&_nc_ohc=lFrglOIG_9EQ7kNvwHz7H7m&_nc_oc=AdmBUkjuwhXQToP_dmqFTXdTFaojm92TZFod1W-Uljo5neq8Ls_vMP9qmEjK25c7UCvOoWpu2zxrMEGjb2sH-0v9&_nc_zt=23&_nc_ht=scontent.fmel18-1.fna&_nc_gid=BqspwJQ7F5JKvTsACwoRpw&oh=00_AfmBChV6-FXb4UJerflrsAqo9GpBiTWAXrmItGPhdRuTVg&oe=693A0C6A"
  }
]
